Tekla Open API Reference for Tekla Structures 2025
GeometrySectionEnumerator Methods
The GeometrySectionEnumerator type exposes the following members.
Methods
Name | Description
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
GeometrySectionEnumerator Class
Tekla.Structures.Model Namespace